const languages = [
    {
      name: 'Язык программирования',
      description: '',
    },
    {
      name: 'JavaScript',
      description: `Не путайте его с Java — это разные и совершенно не похожие языки.
      JavaScript применяют для создания графики, мобильных и веб-приложений, в браузерных операционных системах. Он очень универсален и довольно легок в изучении.`,
    },
    {
      name: 'Python',
      description: `Программы на Python близки к естественному языку, поэтому он отлично подходит как первый язык для начинающего программиста.
      Это очень распространенный язык, на нем реализовано большое количество проектов. Python активно используют в Google, на нем написана большая часть исходного кода YouTube. Также часто применяется при создании машин-роботов.`,
    },
    {
      name: 'Java',
      description: `Язык программирования общего назначения, который стабильно занимает высокие места в рейтингах популярности. Приложения на Java могут работать на любом компьютере, для этого создана виртуальная Java-машина. На Java активно разрабатывают мобильные приложения под операционную систему Android.
      На Java написаны такие успешные проекты, как RuneScape, Yahoo, Amazon, eBay, LinkedIn.`,
    },
    {
      name: 'C#',
      description: `Название языка читается как «си шарп». Его разрабатывали в 1998–2001 годах внутри компании Microsoft для создания приложений.
      C# принадлежит к семье языков с C-подобным синтаксисом, из них он наиболее близок к C++ и Java. Поэтому у C# достаточно сложный синтаксис, что считается недостатком.`,
    },
    {
      name: 'PHP',
      description: `Широко применяется для создания веб-приложений, лидирует по применению для создания динамических сайтов. PHP прошел быструю эволюцию и стал востребован среди программистов. Однако программисты его часто критикуют за несогласованный синтаксис.`,
    },
]
  
export default languages